## Naukri dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/naukri_data_scince/naukri_data_science_jobs_india.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job_Role            12000 non-null  object
 1   Company             12000 non-null  object
 2   Location            12000 non-null  object
 3   Job Experience      12000 non-null  object
 4   Skills/Description  12000 non-null  object
dtypes: object(5)
memory usage: 468.9+ KB

In [3]:
df.head()

,Job_Role,Company,Location,Job Experience,Skills/Description
0,Senior Data Scientist,UPL,"Bangalore/Bengaluru, Mumbai (All Areas)",3-6,"python, MLT, statistical modeling, machine lea..."
1,Senior Data Scientist,Walmart,Bangalore/Bengaluru,5-9,"Data Science, Machine learning, Python, Azure,..."
2,Applied Data Scientist / ML Senior Engineer (P...,SAP India Pvt.Ltd,Bangalore/Bengaluru,5-10,"Python, IT Skills, Testing, Cloud, Product Man..."
3,Data Scientist,UPL,"Bangalore/Bengaluru, Mumbai (All Areas)",1-4,"python, machine learning, Data Science, data a..."
4,Data Scientist,Walmart,Bangalore/Bengaluru,4-8,"IT Skills, Python, Data Science, Machine Learn..."

In [4]:
df.shape

(12000, 5)

In [5]:
df.ndim

2

In [6]:
df.tail()

,Job_Role,Company,Location,Job Experience,Skills/Description
11995,Tech Lead/Architect ( Contractual ),Krazy Mantra HR Solutions Pvt. Ltd,"Kolkata, Chennai, Bangalore/Bengaluru",8-13,"Spark, Python, S3, lambda, Athena, AWS, IT Ski..."
11996,Tech Lead / POD Lead,cliqhr.com,"Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru",10-12,"AirFlow, BigQuery, GCS, Kafka, Java, Shell scr..."
11997,Java Full Stack Developer - Hibernate / Spring,Serving Skill,"Hyderabad/Secunderabad, Bangalore/Bengaluru",2-5,"IT Skills, Java, Software Development, Testing..."
11998,Tech Lead - Azure,cliqhr.com,"Kochi/Cochin, Mumbai, Hyderabad/Secunderabad, ...",8-10,"PowerShell, Azure Data Factory, Azure, PaaS, M..."
11999,Full Stack Developer - Machine Learning,Huquo Consulting Pvt. Ltd,Bangalore/Bengaluru,5-10,"Java, JavaScript, Machine Learning, NoSQL, Clo..."

In [7]:
df = df.astype("string",copy=True)

In [8]:
df.isna().sum()

Job_Role              0
Company               0
Location              0
Job Experience        0
Skills/Description    0
dtype: int64

In [9]:
mask =  df["Job Experience"].str.match(r"^\d{1,3}-\d{1,3}")
print(df[mask].count())

number=  df[~mask].index
n = np.array(number)
n
for i in n:
    df.loc[i,"Job Experience"]="0-0"
df.info()

Job_Role              11993
Company               11993
Location              11993
Job Experience        11993
Skills/Description    11993
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Job_Role            12000 non-null  string
 1   Company             12000 non-null  string
 2   Location            12000 non-null  string
 3   Job Experience      12000 non-null  string
 4   Skills/Description  12000 non-null  string
dtypes: string(5)
memory usage: 468.9 KB

In [10]:
mask =  df["Job Experience"].str.match(r"^\d{1,3}-\d{1,3}")
print(df[mask].count())

Job_Role              12000
Company               12000
Location              12000
Job Experience        12000
Skills/Description    12000
dtype: int64

In [11]:
# diff job role for company
df["Job_Role"].unique().shape

(6563,)

In [12]:
df["Company"].unique().shape

(3507,)

In [13]:
df.duplicated().count()

np.int64(12000)

In [14]:
df["Skills/Description"].unique().shape

(11356,)

In [15]:
# create a function give company then show this group
group =  df.groupby(by="Company")
def find_company(name):
    return group.get_group(name)
count = find_company("cliqhr.com")["Job_Role"].count()
print("avalible job :",count)

avalible job : 35

In [16]:
# create a function the i have particular skill then which total job available
def find_job(skill):
    mask = df["Skills/Description"].str.contains(skill,case=False)
    return df[mask].count()
find_job("python")

Job_Role              3202
Company               3202
Location              3202
Job Experience        3202
Skills/Description    3202
dtype: int64

In [17]:
def find_city_job(city):
    mask = df['Location'].str.contains(city,case=False)
    return df[mask].count()
find_city_job("Chennai")

Job_Role              1301
Company               1301
Location              1301
Job Experience        1301
Skills/Description    1301
dtype: int64

In [18]:
def find_role_job(city):
    mask = df["Job_Role"].str.contains(city,case=False)
    return df[mask].count()
find_role_job("analytics")

Job_Role              433
Company               433
Location              433
Job Experience        433
Skills/Description    433
dtype: int64

In [19]:
df[['min', 'max']] = df['Job Experience'].str.split('-', expand=True).astype(int)

In [20]:
df.pop("Job Experience")
df.head()

,Job_Role,Company,Location,Skills/Description,min,max
0,Senior Data Scientist,UPL,"Bangalore/Bengaluru, Mumbai (All Areas)","python, MLT, statistical modeling, machine lea...",3,6
1,Senior Data Scientist,Walmart,Bangalore/Bengaluru,"Data Science, Machine learning, Python, Azure,...",5,9
2,Applied Data Scientist / ML Senior Engineer (P...,SAP India Pvt.Ltd,Bangalore/Bengaluru,"Python, IT Skills, Testing, Cloud, Product Man...",5,10
3,Data Scientist,UPL,"Bangalore/Bengaluru, Mumbai (All Areas)","python, machine learning, Data Science, data a...",1,4
4,Data Scientist,Walmart,Bangalore/Bengaluru,"IT Skills, Python, Data Science, Machine Learn...",4,8

In [21]:
# fresher total avalible job
print("fresher total avalible job:",df["Job_Role"][df["min"]==0].count())

fresher total avalible job: 405

In [22]:
group= df.groupby(by="Company")["Job_Role"]
group.count().sort_values(ascending=False).head()

Company
Accenture                          490
IBM                                316
Infostretch solutions Pvt. Ltd.    304
Huquo Consulting Pvt. Ltd          295
Anicalls                           115
Name: Job_Role, dtype: int64

In [23]:
df.sort_values(by="Location",ascending=True)

,Job_Role,Company,Location,Skills/Description,min,max
3661,Senior Technical Lead (Data Engineer),Infostretch solutions Pvt. Ltd.,Ahmedabad,"jQuery, Front end, Coding, Javascript, Agile, ...",10,15
11299,AI Computer Vision Developer,IBM,Ahmedabad,"IT Skills, Python, Software Development, Machi...",3,5
7802,Research Analyst,Theaddress,Ahmedabad,"Accounting, Finance, Data Analysis, Data Colle...",0,3
11209,Senior Python Developer - Django/Flask,TalentStack,Ahmedabad,"Flask, Python, Django, AWS cloud, server progr...",2,5
3304,Jr . Data Engineer,Inferenz Tech Pvt Ltd.,Ahmedabad,"Unit Testing, Snowflake, Azure Data Pipeline, ...",0,3
...,...,...,...,...,...,...
4328,Data Engineer,Collabera India,karnataka,"Big Data, IT Skills, Java, Python, Cloud, Jenk...",5,7
1244,Specialist; Data Scientist,Merck,karnataka,"Coding, Enterprise applications, Time series a...",2,5
10913,market research analyst,Seven Consultancy,"lunglei,mizoram","Market Research Analyst, Data collection, Digi...",4,5
11886,Machine Learning Engineer,Predire AnalyzeData Private Limited,punjab,"IT Skills, Java, Python, Machine Learning, Art...",2,5
10063,Business Systems Analyst,"Creative Capsule, LLC","verna,goa","IT Skills, Software Development, Quality Assur...",5,10

In [24]:
df[df["Location"].str.len() == df["Location"].str.len().max()]

,Job_Role,Company,Location,Skills/Description,min,max
2944,Data Analyst,CINDREBAY SCHOOL OF FASHION & INTERIOR DESIGN,"Hyderabad/Secunderabad, Coimbatore, Thodupuzha...","Secondary Data, Database Design Development, B...",1,4

In [25]:
city = df.iloc[2944,2]
print(city)

Hyderabad/Secunderabad, Coimbatore, Thodupuzha, Trivandrum/Thiruvananthapuram, Kochi/Cochin, Kolkata, Cannanore/Kannur, Indore, Nagpur, Pune, Lucknow, Calicut/Kozhikode, Bangalore/Bengaluru

In [43]:
mask = df["Job_Role"].str.contains(pat="scientist")
df[mask]["Job_Role"]="data"

C:\Users\pramit\AppData\Local\Temp\ipykernel_262516\614367503.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[mask]["Job_Role"]="data"